# Problem 01

1. 타이타닉 데이터에 대해...   
Pclass를 원핫인코딩   
Age를 이산화(5개 구간으로 나눔)   
Fare를 이산화(3개 구간으로 나눔)   
embarked를 원핫인코딩

In [1]:
import pandas as pd
import numpy as np

path = r"C:\Users\Administrator\Desktop\filedown\\train.csv"
titanic = pd.read_csv(path)
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [2]:
from sklearn.preprocessing import OneHotEncoder

In [3]:
onehot = OneHotEncoder()
data = np.array(titanic['Pclass'])
data = data.reshape(-1,1)
onehot.fit(data)
pclass_encode = onehot.transform(data).toarray()
pclass_encode

C:\Anaconda3\lib\site-packages\sklearn\preprocessing\_encoders.py:415: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)

array([[0., 0., 1.],
       [1., 0., 0.],
       [0., 0., 1.],
       ...,
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 0., 1.]])

In [47]:
bins = [0.0,15.0,25.0,35.0,60.0,99.0]
labels = ['영유아','청년','중년','장년','노년']
cats = pd.cut(titanic["Age"],bins,labels=labels)
cats

In [50]:
catss = pd.qcut(titanic["Fare"],3,labels=['Low','Middle','High'])
catss

0         Low
1        High
2         Low
3        High
4         Low
        ...
886    Middle
887      High
888    Middle
889      High
890       Low
Name: Fare, Length: 891, dtype: category
Categories (3, object): [Low < Middle < High]

In [82]:
titanic['Embarked'].value_counts()

ohn = OneHotEncoder()
embarked = np.array(titanic['Embarked'].fillna(method='ffill')).reshape(-1,1)
ohn.fit(embarked)
ohn.transform(embarked).toarray()

array([[0., 0., 1.],
       [1., 0., 0.],
       [0., 0., 1.],
       ...,
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.]])

# Problem 02

리스트를 거꾸로 출력하는 반복문을 만들어 보세요.

In [85]:
list1 = list(range(10))
list1

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [97]:
for i in reversed(list1):
    print(i, end = ' ')
print('\n'+'==' * 10 )
for i in sorted(list1, reverse=True):
    print(i, end = ' ')
print('\n'+'==' * 10 )
for i in range(9,-1,-1):
    print(list1[i], end = ' ')

9 8 7 6 5 4 3 2 1 0
====================
9 8 7 6 5 4 3 2 1 0
====================
9 8 7 6 5 4 3 2 1 0

# Problem 03

리스트에서 중복 값을 제거해 보세요.

ns = [1, 3, 5, 1, 3, 5, 1, 3, 5]

In [108]:
ns = [1, 3, 5, 1, 3, 5, 1, 3, 5]
df = pd.Series(ns)
df2 = df.drop_duplicates()
ns2 = list(df2)
ns2

[1, 3, 5]

# Problem 04

bins = [1, 15, 25, 35, 60, 99]    
labels = ["미성년자", "청년", "중년", "장년", "노년"]    
타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해    
'미성년자', '청년', '중년', '장년', '노년' 승객의 비율을 구한다.   
각 그룹 별로 비율의 전체 합은 1이 되어야 한다.

In [109]:
bins = [1, 15, 25, 35, 60, 99]    
labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [178]:
titanic['age'] = pd.cut(titanic["Age"],bins,labels=labels)
titanic.sort_values(by='Survived')
survived = titanic[titanic['Survived'] == 1]['age'].value_counts(0)
died = titanic[titanic['Survived'] == 0]['age'].value_counts(0)
# pd.DataFrame([survived , died],columns=['Survived','Unsurvived'],index=['청년','장년','노년'])
data = pd.concat([survived, died], axis = 1)
data.columns = ['Survived','Died']
data['Sum'] = data.sum(axis = 1)
data['Surv_rate'] = data['Survived']/data['Sum']
data['Died_rate'] = data['Died']/data['Sum']
data['Total_rate'] = data.Surv_rate + data.Died_rate
data

      Survived  Died  Sum  Surv_rate  Died_rate  Total_rate
미성년자        37    32   69   0.536232   0.463768         1.0
청년          75   143  218   0.344037   0.655963         1.0
중년          83   113  196   0.423469   0.576531         1.0
장년          78   117  195   0.400000   0.600000         1.0
노년           5    17   22   0.227273   0.772727         1.0